{
"home": {
  "title": "<b>Towards a National Collection - HeritagePIDs</b>",
  "content": "<div class=\"alert alert-info\" role=\"alert\"><p>How can we build a national collection if we do not know what is in it?<\/p><\/div><p>Museums, heritage collections and sites in the UK house at least 200 million physical and digital objects. Being able to identify these objects supports their discovery, use and curation - you cannot provide persistent or even consistent access to an item if you don't know what it is. Accession numbers are a key component in all collection and library management systems but these only cover selected objects within an individual collection. To fully realise the potential of our national collections, we need identifiers that can bring together collections across institutional boundaries.<\/p><p>Persistent Identifiers (PIDs) provide a long-lasting click-able link to a digital object. They are recognised by UKRI as a tool for enabling data discovery, access and citation. Supporting wider use of PIDs for collection objects, environments, specimens and related items will allow long-term, unambiguous linking of collections that will create a digital National Collection. However, the challenges, utility and wider benefits of PIDs are not as well understood across the heritage sector as they could be.<\/p><p>This project will bring together best practices in the use of PIDs, building on existing work and projects. We will share expertise and provide recommendations on the approach to PIDs for colleagues in institutions across the UK heritage sector. Through a mixture of workshops, desk research and case studies, the project will answer questions such as 'What are the gaps in the existing PID landscape for heritage collections, buildings and environments?' and 'What should a PID infrastructure, strategy and governance framework look like for a unified national collection?'.<\/p><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": "<figure class=\"figure\"><img src=\"graphics/Japanese Camellia.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37.\"><figcaption class=\"figure-caption\">Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37. Public Domain.<\/figcaption><\/figure>"
  },
"about": {
  "class": "gallery",
  "file": "logos.json",
  "title": "<b>Heritage PIDs - Contributors</b>",
  "content": "<p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": ""
  },
"resources": {
  "title": "<b>Heritage PIDs - Resources</b>",
  "content": "<p>This page will be updated throughout the project as new material becomes available.</p><h4>Project Outputs</h4><ul><li>Developing Identifiers for Heritage Collections <a href=\"https://tanc-ahrc.github.io/PIDResources/\">https://tanc-ahrc.github.io/PIDResources/</a></li><li>Project Interim Report <a href=\"https://www.nationalcollection.org.uk/interim\">https://www.nationalcollection.org.uk/interim</a></li><li>PIDs as IRO Infrastructure - Early Findings <a href=\"https://doi.org/10.23636/1214\">https://doi.org/10.23636/1214</a></li><li>HeritagePIDs Zotero Group <a href=\"https:\/\/www.zotero.org\/groups\/2470432\/heritagepids\/\">https:\/\/www.zotero.org\/groups\/2470432\/heritagepids<\/a><\/li></ul><p><b>Case Studies</b></p><ul><li>Persistent Identifiers at the British Library <a href=\"https:\/\/doi.org\/10.23636\/1242\">https:\/\/doi.org\/10.23636\/1242<\/a><\/li><li>Persistent Identifiers at the National Gallery <a href=\"https:\/\/doi.org\/10.23636\/1243\">https:\/\/doi.org\/10.23636\/1243<\/a></li><li>Persistent Identifiers at the Natural History Museum <a href=\"https://doi.org/10.22020/k99s-we61\">https://doi.org/10.22020/k99s-we61</a></li></ul><h4>Webinars</h4><ul><li>Towards a National Collection: Persistent Identifiers as IRO Infrastructure Project Launch Webinar <a href=\"https:\/\/doi.org\/10.23636\/1174\">https:\/\/doi.org\/10.23636\/1174<\/a><\/li><li>Webinar: Identifiers in Heritage Collections - how embedded are they? <a href=\"https://doi.org/10.23636/1189\">https://doi.org/10.23636/1189<\/a><\/li><li>Webinar: Persistent Identifiers (Rachael Kotarski) & Locating a National Collection (Gethin Rees) <a href=\"https://youtu.be/jLbK4E_ebMM\">https://youtu.be/jLbK4E_ebMM</a></li><li>Webinar: Developing Identifiers for Heritage Collections <a href =\"https://www.youtube.com/watch?v=Z_6W5LJloak&list=PLRIxrpy54RHYlVCPClUzr4XpN1mKg_fBi\">https://youtu.be/Z_6W5LJloak</a></li></ul><h4>Blog Posts</h4><p>See our <a href=\"https://tanc-ahrc.github.io/HeritagePIDs/Blog.html\">blog</a> for more blog posts and short case studies relevant to the project.</p><ul><li>When is a persistent identifier not persistent? Or an identifier? <a href=\"https://blogs.bl.uk/digital-scholarship/2020/09/when-is-a-persistent-identifier-not-persistent-or-an-identifier.html\">https://blogs.bl.uk/digital-scholarship/2020/09/when-is-a-persistent-identifier-not-persistent-or-an-identifier.html</a></li><\/ul><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>", 
  "content right": ""
},
 "timeline": {
   "title": "<b>Heritage PIDs - Project Timeline</b>",
  "content": "<p>This timeline is provisional due to the COVID-19 pandemic and is being updated throughout the project. Last updated April 2021.<\/p><table class=\"table\"><tr><th scope=\"col\">Date<\/th><th scope=\"col\">Milestone Type<\/th><th scope=\"col\">Detail<\/th><\/tr><tbody><tr><td>January 2020<\/td><td>Dissemination<\/td><td>PIDapalooza - lightning talk<\/td><\/tr><tr><td>April 2020<\/td><td>Dissemination&nbsp;Deliverable<\/td><td>RDA PID IG &ndash; lightning talk&nbsp;Webinar #1<\/td><\/tr><tr><td>May 2020<\/td><td>Deliverable<\/td><td>Survey #1 Launched<\/td><\/tr><tr><td>July 2020<\/td><td>Dissemination<br>Deliverable<\/td><td>Webinar #2 based on interim survey results <br> Demonstrator tool: in beta<\/td><\/tr><tr><td>August 2020<\/td><td>Dissemination<\/td><td>Case study #1 &ndash; British Library&nbsp;<\/td><\/tr><tr><td>September 2020<\/td><td>Deliverable<\/td><td>Case study #2 &ndash; National Gallery<\/td><\/tr><tr><td>October 2020<\/td><td>Deliverable<\/td><td>Interim report<\/td><\/tr><tr><td>January 2021<\/td><td>Deliverable <br> Dissemination<\/td><td>Workshop based on survey and case studies # 1&amp;2<br>PIDapalooza 2021<\/td><\/tr><tr><td>April 2021<\/td><td>Dissemination<br>Deliverable<\/td><td>Webinar<br>Consultation of Developing IDs for Heritage Collections<br>Case study #3 &ndash; NHM<\/td><\/tr><tr><td>July 2021<\/td><td>Dissemination<br>Deliverable<\/td><td>Workshop #4 &ndash; Edinburgh&nbsp;Launch full version of Developing IDs for Heritage Collections. Case study #4 &ndash; RBGE<\/td><\/tr><tr><td>August 2021<\/td><td>Deliverable<\/td><td>Video summarising best practices<\/td><\/tr><tr><td>September 2021<\/td><td>Dissemination<\/td><td>Webinar<\/td><\/tr><tr><td>October 2021<\/td><td>Dissemination<\/td><td>Survey #2 launched<\/td><\/tr><tr><td>December 2021<\/td><td>Dissemination<br>Deliverable<\/td><td>Final event including survey #2 results<br>Final report<\/td><\/tr><\/tbody><\/table>",
   "content right": ""
},
 "Blog": {
     "class": "list",
     "file": "blog-list.json",
     "title": "<b>Heritage PIDs - Blog</b>",
     "content": "",
     "content right": ""
 },
  "LCD Blog": {
    "title": "<b>Linked Conservation Data and PIDs</b>", 
    "parent": "Blog",
    "content": "<p><i>Frances Madden <a href=\"http://orcid.org/0000-0002-5432-6116\">(orcid.org/0000-0002-5432-6116)</a></i></p><p> Posted 12 November 2020</p><br><p><a href=\"https://www.ligatus.org.uk/lcd/\">Linked Conservation Data</a> (LCD) is a project led by the University of the Arts London and the Stanford University Library amongst others. It aims to explore heritage conservation data, conservation documentation records, such as treatment reports, expressed as structured data and apply Linked Open Data techniques to it. The project is funded by the UK's Arts and Humanities Research Council and is now in its second phase.</p><p>Conservation systems and practices do not have a tradition of assigning identifiers to records or the objects with which they are concerned, and therefore the systems do not always use identifiers consistently either. In addition, conservation systems can often be separate and siloed from cataloguing and collection management systems, as is the case at the British Library, amongst other institutions, reducing the interoperability across systems. The LCD project wants to explore research questions which integrated conservation information can answer e.g. the use of particular techniques over time and the geographical use of particular techniques as well as the information conservation data can provide about a collection. From an identifier perspective the project’s work involves assigning identifiers both to conservation terms and the items which are being conserved.</p><p>During this phase of the project, they have produced draft <a href=\"https://www.ligatus.org.uk/lcd/output/193\">vocabulary guidelines</a> to assist others in producing Linked Data for conservation records and terms used within them. In phase one of the project the need for identifiers as a key component of Linked Data was recognised. The project aims to explore and connect vocabulary terms held in different partners’ cataloguing systems, to be able to cross-link terms. LCD have decided to utilise <a href=\"https://www.w3.org/2004/02/skos/\">SKOS</a> which is a long existing defined framework for publishing thesauri, vocabularies and taxonomies in a structured and machine readable format, therefore maximising interoperability. More generally, the idea of creating identifiers for vocabularies presents some specific requirements.</p><p>The project is exploring the extent to which terms can be matched and issues concerning granularity of terms. They have also adopted the best practice approaches of assigning Uniform Resource Identifiers (URIs) to the terms used and this requirement is included in the draft terminology guidelines. They are also exploring how best to leverage existing infrastructure such as existing thesauri of terms some of which already have URIs in use, e.g. the <a href=\"https://www.getty.edu/research/tools/vocabularies/aat/\">Getty Art and Architecture Thesaurus</a> (AAT).</p><p>For vocabulary maintainers LCD suggests registering URIs using the <a href=\"https://w3id.org/\">w3id.org</a> system. The <a href=\"https://www.ligatus.org.uk/lcd/output/142\">workflow diagrams</a> produced by the project suggest either linking terms in an organisation’s system to an existing vocabulary which already uses URIs or assigning locally produced URIs to the terms created.</p><p>The National Gallery, a partner in both LCD and the PIDs as IRO Infrastructure projects, which has developed their own infrastructure as part of a pilot project to mint URIs, described in the project case study which is soon to be published, has offered to host URIs for the next phase of the project using a simple vocab server or <a href=\"https://www.researchspace.org/\">ResearchSpace</a> instance. The issue of URIs being dereferenceable is apparent from the guidelines created by the project, for vocabulary terms. While it is best practice that URIs resolve to information about the term referenced, at the moment this is not an absolute requirement. Making it a requirement would mean that entering the Linked Data realm would require significant new infrastructure to host and serve data and the partners in Linked Conservation Data do not want to make it too difficult for organisations with limited resources to take this first step. In the meantime employing identifiers in current systems helps with adoption of good practices which can lead to making their conservation data available as Linked Open Data.</p><p>The benefit from these URIs from being universally and globally resolvable, i.e. being able to resolve to the record without knowing which institution created the record, is not clear at this stage in the project, nor is it being actively explored at this stage for the reasons described above. As an example of a globally resolvable identifier, ‘https://data.ng-london.org.uk/0F6J-0001-0000-0000’ could be expressed instead as a DOI such as ‘https://doi.org/10.12345/0F6J-0001-0000-0000’, removing the requirement for any knowledge by the user of the ‘data.ng-london.org.uk’ namespace. This capability may benefit some of the widely used vocabularies such as the AAT and encourage the adoption of a single or one system, becoming a de facto terminology hub, but issues of granularity and mapping terms from internal systems would still need to be addressed. As most of the organisations involved in the project are memory institutions themselves, they may already have the infrastructure in place to provide long lasting identifiers, however the lack of centralised governance associated with locally managed identifiers presents a risk to the long term accessibility of the URIs in this aspect and the interest and willingness of these organisations to commit to hosting these identifiers is also untested.</p><p>The different entity types assigned URIs may also present different issues when it comes to their long term maintenance. While vocabulary terms may be used by multiple organisations and would clearly warrant long term community driven sustainability efforts to maintain the URIs for the terms and keep them updated, the same may not be the case for the URIs for collection items undergoing conservation as they may only be linked and used by its holding organisation.</p><p>For the partners involved in the project, some, but not all, are already able to create internal identifiers within their own systems. While the internal system identifiers may provide some degree of solution across internal systems e.g. between cataloguing and conservation, they are not necessarily persistent and they may not be ideal for Linked Data even if they are formed as URIs. It seems sensible for any organisation who is implementing a new system or upgrading an existing system to consider exposing this data in an open format as part of the implementation. The LCD project is investigating hosting the infrastructure on a jointly held repository or portal within the project partners which will be machine readable and query-able via a SPARQL endpoint and API with web-browsing capability for human readable access. This portal, an instance of ResearchSpace, will provide a useful prototype demonstrating the potential of the approaches but a model for its long term sustainability is yet to be decided.</p><p>While sustainability is a challenge for any type of identifier, identifiers for heritage objects address several different use cases, including reference and citation as well as conservation, and it is anticipated conservation data would only be one of those, strengthening the case for identifiers being assigned to collection items. The survey conducted by the PIDs as IRO Infrastructure Project (described <a href=\"https://doi.org/10.23636/1214\">here</a>) found that many of the organisations who were using PIDs were using URIs as a result of applying Linked Open Data approaches to their collection items (<a href=\"https://doi.org/10.23636/1210\">summary data</a>). The use case for conservation data presents another dimension to these efforts and could result in identifiers being embedded in aspects of collections which they otherwise would not.</p>",
    "content right": ""
 },
  "V&A Case Study": {
   "title": "<b>(Persistent) Identifiers at the V&A - A Case Study</b>",
   "parent": "Blog",
   "content": "<p><i>Frances Madden <a href=\"http://orcid.org/0000-0002-5432-6116\">(orcid.org/0000-0002-5432-6116)</a></i></p><p> Posted 2 December 2020</p><br><p>The <a href=\"https://www.vam.ac.uk/\">Victoria and Albert Museum </a>(V&A) is a museum of art and design and houses over 2.3 million items including fashion, photography and sculpture. It is also home to the National Art Library and has an extensive archive collection.</p><p>The museum uses several different types of identifiers across the entire collection including the museum, archive and library collections. Museum or object numbers are assigned to collection items, but part numbers can be assigned to removable pieces of collection items, for example, a chest of drawers will have a museum number but every drawer will have a part number. Archive collections are catalogued to series level, which can include thousands of individual documents and pages, so many items within a series would not have an individual identifier assigned to them. However temporary identifiers are assigned to archival items if they are to be displayed in an exhibition or loaned. The library collection has two potential types of identifier: barcodes, which do not integrate with the library management system provided by <a href=\"https://www.oclc.org/en/home.html\">OCLC</a>, and shelf numbers. All of these identifiers address an internal use case but none are used to provide an online identifier or have any governance to ensure their persistence. Items in the collection can move between different areas resulting in their museum number being changed, leading to items having multiple numbers.</p><p>Collections management at the V&A, similar to many other museums, has a number of human processes associated with it, including manual accessioning into the collections. Practices also vary across museums about how museum numbers and part numbers are assigned. In addition, when items are accessioned into the collection they can go through a bulk inventory process where a number of objects, such as all the items in a box, are accessioned together.</p><p>For the museum’s digital collections, the online presence of the collections, the <a href=\"http://collections.vam.ac.uk/\">collections website</a> at the V&A contains information about more than 1.2 million objects, over 600,000 of which have images. The collections site uses a standard syntax to construct URLs. This system utilises the information from the collection management system and pulls it through to web pages dedicated to each museum object. These URLs have been in place since 2009 and utilise the database identifier from the collection management system and either the title of the item, the object type in addition to the artist or maker if it is known.</p><p>For example:</p><figure class=\"figure\"><img src=\"graphics/vamcasestudyimage.JPG\" class=\"figure-img img-fluid rounded\" alt=\"Image displaying the structure of the URLs on the Victoria and Albert Museum's collections website.\"><figcaption class=\"figure-caption\">Figure 1: The Structure of URLs on the V&A's <a href=\"http://collections.vam.ac.uk/\">collections website</a>.</figcaption></figure><p>These URLs are actively maintained and this will continue when the digital collections site is migrated in the near future. There was some debate about changing the URLs to improve the search engine optimisation of the site but it was agreed to keep them in an attempt at persistence. While there is no official governance or policy around the persistence of these URLs, there is a recognition by the staff of the museum that it would be best practice to maintain them as they are a long established method of access to the digital collection. This decision to maintain the collection site URLs demonstrates the importance of institutional memory and awareness of an external context in maintaining these identifiers when there is no additional governance in place which globally resolvable identifiers can provide.</p><p>The V&A's use of identifiers highlights some interesting points around the requirements for PIDs in a museum setting, particularly one with a large and heterogeneous collection. Identifiers would need to be assigned to a large number of different types of item and to be able to accommodate hierarchies and relationships for complex objects but also to express different representations of them, e.g. digitised versions versus the physical objects themselves. The capability for cross-walking these hierarchies in different ways is also an issue if these identifiers are to operate across institutions. The fact that the collections’ online presence is managed entirely separately to the internal identification system demonstrates the conceptual difference between physical and digitised collection items. This also means the link between the physical and digitised object lacks persistence as the database identifier used to connect the digitised and physical object could change if the collection management system were updated and the historical identifier was not maintained in some way.</p><p>This conceptual difference is particularly evident with photographic collections where a  photograph within an album and which has been digitised can be catalogued in several different systems. Whether something is catalogued in the digital asset management system or in the main collection management system will affect the metadata captured about itand whether it is treated as a digital or physical item, and in turn the metadata made available both to internal and external users of the item. In addition the V&A has a significant cataloguing backlog where batch processes were used to inventory items, which means that there are a large number of items which cannot be assigned identifiers automatically. Even within catalogued items, across museums the vast majority of museum objects have no digital presence, or only minimal metadata description and this is an issue which can stymie the adoption of PIDs for citation of objects and in internal processes.</p><p>The appetite for making collections available digitally has not always been high in many museums, where visitor numbers are a key metric and the research and digital use of collections is not given the same value. While there is some interest in tracking citation of museum items, the question of what should be included in the citation remains. Should it be the museum number or a fully resolvable PID which refers to the item? Should the citation even include the museum number?  The V&A does not have any explicit guidance on this and follows the individual publication’s recommendations or requirements.</p><p>The V&A is active in the <a href=\"https://linked.art/\">Linked Art</a> project which aims to provide linked open data approaches to collection data using <a href=\"http://www.cidoc-crm.org/\">CIDOC-CRM</a> as a basis. Linked open data provides one of the key methods in which identifiers can be leveraged and viewed to provide value to a museum collection beyond a research citation value. The connection of different collections together is an application of the national collection and demonstrates the vital need of identifiers within collections.</p>",
   "content right": ""
  },
  "PIDs for Places": {
    "title": "<b>PIDs for Places</b>",
    "parent": "Blog",
    "content": "<p><i>Frances Madden <a href=\"http:\/\/orcid.org\/0000-0002-5432-6116\">(orcid.org\/0000-0002-5432-6116)<\/a><\/i><\/p><p>Posted 17 February 2021<\/p><br><p>Many of the case studies we have looked at so far in the Heritage PIDs project have focused on persistent identifiers (PIDs) for collection items and people associated with those items. However people are not the only entities that can be associated with items and which have authority files in museum, library and archive management systems, places are often added to management systems as authority files. In addition many systems contain large amounts of other location data e.g. location collected, place of publication etc. There has been interest expressed in PIDs for places and locations over the past several years. It was noted by the FREYA project’s <a href=\"https:\/\/doi.org\/10.5281\/zenodo.3554255\">landscape survey<\/a> in 2018 and several tools have been developed for capturing PIDs for places, one of which is discussed here.<\/p><p><a href=\"https:\/\/tanc-ahrc.github.io\/LocatingTANC\">Locating a National Collection<\/a> is another foundation project in the Towards a National Collection programme, which is investigating the role of location in relation to building a national collection. It aims to help organisations use location data to connect their collections and engage audiences in new ways. Within the project's objectives, they include 'understand how location is referenced and represented in IRO collections', 'scope and describe the technical components necessary to connect collections using location, the available options and make recommendations for potential paths to progress', and 'to develop and evaluate a prototype access interface to enhance our understanding of user requirements and potential case studies'. It is hoped that strengthening the connections between resources in GLAM institutions and places will help the resources resonate more with general audiences and the project is exploring the idea that concepts such as ‘place identity’, ‘locality’ and ‘proximity’ might be engagement drivers for users browsing collections.<\/p><figure class=\"figure\"><img src=\"graphics\/BL Kings Topographical collection.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Image of a map from the King's Topographical Collection at the British Library\"><figcaption class=\"figure-caption\"><a href=\"https:\/\/www.flickr.com\/photos\/britishlibrary\/50266131877\/in\/album-72157716220271206\">The BL King’s Topographical Collection:<\/a>'Hemisphaerium Coeli Australe (Boreale)'<\/figcaption><\/figure><p>The importance of location for a national collection is as a point of commonality across collections held by different organisations. If users are able to search across different collections simultaneously and find items related to a particular location, they can be used by both research users and the general public. At present conducting searches across different collections requires time, dedication and considerable skill on the user’s behalf. Organisations hold location data in their collection metadata but this is not in any standardised form across the sector.<\/p><p>For GLAM organisations, one of the main reasons PIDs are useful when dealing with location data is they help disambiguate between places which have the same name (e.g. <a href=\"https:\/\/www.wikidata.org\/wiki\/Q1524\">Athens, Greece<\/a> vs. <a href=\"https:\/\/www.wikidata.org\/wiki\/Q203263\">Athens, Georgia<\/a>) and can help with identifying the same place described using a different name either in different languages (<a href=\"https:\/\/www.wikidata.org\/wiki\/Q10690\">Caerdydd and Cardiff<\/a>) or because a place has changed name over time (<a href=\"https:\/\/www.wikidata.org\/wiki\/Q745989\">Kingstown and Dún Laoghaire<\/a>). Identifiers can be used to connect these concepts together so they can be understood to be the same, preventing data silos. Often cataloguing guidelines will have addressed these issues at the level of an individual system where standardised terms are used but these can change over time and many organisations will have more than one cataloguing system, e.g. one for library collections and one for archives, and these may not have the same standards. Once you start combining data from across heterogeneous systems and different organisations the problems increase in scale.<\/p><p><i>Note: The links in the examples connect to Wikidata examples to demonstrate how these variations can be understood, other identification methods such as gazetteers are described elsewhere in this post.<\/i><\/p><figure class=\"figure\"><img src=\"graphics\/Toronto past and present.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Image of the Imperial Bank Buildings Wellington Street East in Toronto\"><figcaption class=\"figure-caption\"><a href=\"https:\/\/www.flickr.com\/photos\/britishlibrary\/11170799453\/in\/album-72157648496372185\">British Library digitised image<\/a> from page 370 of 'Toronto: past and present: historical and descriptive. A memorial volume for the semi-centennial of 1884, etc'<\/figcaption><\/figure><p>Applications using location PIDs could include adding coordinates to create maps and other visualisations, understanding the movement of collection items and illustrating all collection items related to a particular place, increasing users’ understanding. One of the most successful examples of a research community within cultural heritage using identifiers, any identifiers - not just those related to location, is the <a href=\"https:\/\/pelagios.org\">Pelagios<\/a> network. The network allows researchers and curators to work together to link and explore the history of places. To do this, they use online gazetteers which are a type of geographical dictionary, some of which have been made available in a linked open data format and therefore have uniform resource identifiers (URIs), or a sort of PID.<\/p><p>The Pelagios network created a tool called <a href=\"https:\/\/recogito.pelagios.org\">Recogito<\/a> which allows you to tag place references contained in texts or images with gazetteer URIs, such as from <a href=\"https:\/\/pleiades.stoa.org\">Pleiades<\/a>, and visualise them on a map. These URIs are connected in a standard way which can be exported in formats such as <a href=\"https:\/\/en.wikipedia.org\/wiki\/Comma-separated_values\">csv<\/a> and <a href=\"https:\/\/www.w3.org\/RDF\">RDF<\/a> to be queried and analysed by researchers. This has been used in many research projects to investigate documents of interest (either textual corpora, archaeological collections or others) in a spatial perspective, gaining a new understanding of them and highlighting new perspectives but also disciplines such as cartography, see the <a href=\"https:\/\/medium.com\/pelagios\">Pelagios blog<\/a> for examples. The Locating a National Collection project is building on this work and exploring the applicability of tools such as Recogito in augmenting collections with identifiers. The URIs used in a gazetteer like Pleiades can be resolved in both human and machine readable formats. While it is not necessary for them to be resolvable (a user can click on them and is directed to a webpage with metadata about the location) to link, it does make it easier for an end user to engage with them.<\/p><figure class=\"figure\"><img src=\"graphics\/Battles of the 19th century.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Digitised image from a book illustrating the locations of battles in the 19th century\"\\\"><figcaption class=\"figure-caption\"><a href=\"https:\/\/www.flickr.com\/photos\/britishlibrary\/11133516016\/in\/album-72157638735426654\">British Library digitised image<\/a> from page 586 of 'Illustrated Battles of the Nineteenth Century, by Archibald Forbes, Major Arthur Griffiths, and others.'<\/figcaption><\/figure><p>There are several gazetteers available in linked open data format in addition to Pleiades and gazetteers have gained particular traction for scholars of the Classical world but their coverage is not uniform across time periods, e.g. there are very few for the Medieval period. Wikidata can also be used for this purpose, while not a gazetteer, it contains large amounts of location data in a standardised linked format.<\/p><p>However concepts of location can have the following issues which need to be addressed when assigning PIDs:<\/p><ul><li>Concepts of location can change over time. Collections can relate to items created at any point over thousands of years. Names of places change but also the boundaries which define a place can evolve. For example Wikidata provides an ID for Athens, the capital city of Greece but also for Classical Athens, the city-state in ancient Greece. These two concepts are related in Wikidata’s model but are not considered the same. Another example of evolving concepts of places would be how the boundaries of local government areas can change over time.<\/li><li>Concepts of place can be ambiguous and it is not possible to determine to which place a text refers.<\/li><li>The systems holding location data are diverse and they can manage location terms in different ways, e.g. some fields may be linked to authority records but some are not.<\/li><li>Metadata is not standardised across organisations and concepts can be represented in various ways, using different terminologies and in diversely named fields. This makes it difficult to extract the information automatically.<\/li><li>There can be many possible locations associated with a collection item, it can be difficult to determine if all of these should be connected to an item. At what point does it become too much for a human user to understand.<\/li><li>There can also be a lot of location data missing from collection metadata due to minimal cataloguing practices.<\/li><li>There can also be a lot of location data missing from collection metadata due to minimal cataloguing practices.<\/li><\/ul><p>So what do cultural heritage organisations need to think about to start using location PIDs? For one thing, organisations should think about augmenting their existing collection information with external identifiers. Several of the case studies the Heritage PIDs project has looked at so far focused on the creation of PIDs for items in organisations’ collections. However, there are benefits to linking to collection items and other external entities from your own system. Another foundation project, <a href=\"https:\/\/www.sciencemuseumgroup.org.uk\/project\/heritage-connector\">Heritage Connector<\/a>, is developing a tool to use Wikidata identifiers to do just that.<\/p><p>Scale is always an issue when dealing with large existing collections. How do you find all the related identifiers and add them into the collection management system? This issue has not been fully resolved but the <a href=\"https:\/\/livingwithmachines.ac.uk\">Living with Machines<\/a> project has developed tools to help with automated matching of terms which could be applied here. Some collection management systems can also struggle to support identifiers presented as resolvable links within them. For ongoing collecting, cataloguing staff would need to be trained on the appropriate use of these identifiers and best practice is still emerging on their use in cataloguing.<\/p><p>PIDs for location data probably provide one of the best success stories in terms of identifiers being used to facilitate innovative research, however there is no scheme as yet which can be adopted universally and in turn collection management systems lack the functionality to support location identifiers. Despite this, any organisation which is considering implementing persistent identifiers within their systems should definitely look at including their location data within the scope of that implementation and exploring ways to increase the interoperability of their collection data.<\/p>",    
    "content right": ""
   },
  "Archives Hub": {
    "title": "<b>Aggregating archive data with and without PIDs</b>",
    "parent": "Blog",
    "content": "<p><i>Frances Madden [(orcid.org/0000-0002-5432-6116)|https://orcid.org/0000-0002-5432-6116]</i></p><p>Posted 26 February 2021</p><p>So far we have used these blog posts to cover different types of collection information which might benefit from persistent identifiers as well as how the various institutions involved with the project which have not yet implemented persistent identifiers might benefit from them. On this occasion we turn to one of the aggregators of UK GLAM collections, the [Archives Hub|https://archiveshub.jisc.ac.uk/], to find out how they use identifiers and how they might assist them in the future.</p><h4>Aggregation and a ‘national collection’</h4><p>As the [Towards a National Collection|https://www.nationalcollection.org.uk/] programme is working towards developing a \"unified virtual 'national collection'\", therefore an aggregator has the unique perspective on the barriers which exist between collections and the issues encountered when trying to join them together. Persistent unique identifiers can play a crucial role in combining collections in a sustainable way so we wanted to get the view of the Archives Hub on this work.</p><h4>About the Archives Hub</h4><p>According to its [website|https://archiveshub.jisc.ac.uk/introduction/], 'the Archives Hub brings together descriptions of thousands of the UK's archive collections. Representing over 330 institutions across the country, the Archives Hub is an effective way to discover unique and often little-known sources…often representing collections being made available for the first time.' The Archives Hub system is based on [CIIM|https://www.k-int.com/products/ciim/], a product supplied by Knowledge Integration, which is also being implemented by the National Gallery to support the integration of their collections across different systems.</p><p>Archives across the UK contribute to the Archives Hub either via filling in the Archives Hub own EAD (Encoded Archival Description) [Editor form|https://archiveshub.jisc.ac.uk/eadeditor/], through exporting from an existing archive management system or harvesting via an OAI-PMH endpoint. The Hub maintains a variety of methods to support the wide range of archives with which it works, including some very small and under resourced repositories. The staff at the Archives Hub have a large amount of expertise in rationalising and working with data from a wide array of systems and making it interoperable with their own system. As a result of this they accept data in a range of formats so long as it is compatible with EAD.</p><h4>Names project</h4><p>Recently the team began working on a project with [Knowledge Integration|https://www.k-int.com/] around names within the Archives Hub. As the Archives Hub was officially launched in 2001 and it doesn't have any standardised use of names in the data it holds but would like to rationalise them to aid resource discovery. EAD/ISAD(G) does not harmonise the fields with index terms, which are generally the links to authority files within a collection. This means that often Creator names will appear in an array of formats, which are different from the index term which will be created in a standard format and include useful information such as date and perhaps epithet.</p><p>For example this [record|https://archiveshub.jisc.ac.uk/data/gb12-ms.add.9267] contains a Creator written in the format first name, surname. At the bottom of the page, it contains index terms which format the same name as surname, first name, dates, epithet. Within one record it is obvious that these two names are the same, but trying to apply automatic matching protocols across hundreds of thousands of names from hundreds of collections, it is not so clear. As Creator is a free text field, sometimes during harvesting the format is not standardised meaning it can include terms such as ‘various’ or additional text such as ‘Created by’ or ‘Possibly’ is included before a proper name.</p><figure class=\"figure\"><img src=\"graphics\/RobertHill-1.png\" class=\"figure=img img-fluid rounded\" alt=\"Screenshot of Robert Hill: Correspondence and Papers from the Archives Hub\"></figure><figure class=\"figure\"><img src=\"graphics\/RobertHill-2.png\" class=\"figure=img img-fluid rounded\" alt=\"Screenshot of Robert Hill: Correspondence and Papers from the Archives Hub\"></figure><p>Jane Stevenson from the Archives Hub has [blogged|https://blog.archiveshub.jisc.ac.uk/category/names-project/] extensively about the project and describes many of the issues encountered when trying to algorithmically de-duplicate hundreds of thousands of names. Through a lot of hard work, they have developed a process to standardise name formats across the metadata they hold. Once that has been done they can begin the process of deduplication. It was noted that once identifiers are in use, format matters less because you can connect different entities together with a 'same as' relationship, regardless of how the name string itself is formatted. This is true not only for names but for any type of entity, such as location, subject or organisation etc. Once the identifier is a constant connection it can be used in multiple systems. The Archives Hub's own cataloguing tool encourages [VIAF|http://viaf.org/] IDs to be added to names by providing a lookup to VIAF. Any names with the VIAF ID will be uniquely identifiable, however they are structured.</p><p>The names project has also highlighted another issue mentioned in the previous blog post about persistent identifiers for location data - how to deal with uncertainty. For many of the names held within the Archives Hub, this may be the only mention of them. Traditional authority files are maintained by a single institution and can often lack detail due to the limited sources and resources available within the archive. Key information may be lacking from known individuals and this results in a large number of records from different organisations with sparse metadata, meaning it is difficult to make definitive matches across collections. However by making that information available, one invites these connections to be made by others.</p><h4>Links to digital content</h4><p>The Archives Hub provides links to digital content held within contributing archives as well as supporting collection information. </p><figure class=\"figure\"><img src=\"graphics\/SalfordStreet.png\" class=\"figure=img img-fluid rounded\" alt=\"Screenshot of a record linking to digital content on the Archives Hub\"></figure><p>This can be done in a couple of ways, the first is where the contributing organisation provide a link which is displayed on the Archives Hub, as in the [screenshot|https://archiveshub.jisc.ac.uk/data/gb427-usp/usp/3/110a] above. These links would ideally be persistent, but in many cases they break. Links to collection items frequently break and the Archives Hub has recently agreed a link check service with their system supplier to ensure the continued access of collections. This is a clear demonstration of how persistent identifiers help in building robust long-lasting connections to collection information.</p><p>The Archives Hub can also display images by importing them using the URL and storing them locally, as in the [screenshot|https://archiveshub.jisc.ac.uk/data/gb1837-des/dca/des/dca/14b/27/12.4] below and there have been discussions about making that a more permanent feature of the service, offering a repository type function to Archives. This method does ensures the image remains available, but ironically the image may then be removed from the URL but still be viewable on the Archives Hub.</p><figure class=\"figure\"><img src=\"graphics\/4waysoflivingcover.png\" class=\"figure=img img-fluid rounded\" alt=\"Screenshot of record with a digital image from the Archives Hub\"></figure><h4>Identifiers for discovery</h4><p>Records in the Archives Hub are assigned opaque URIs which can be viewed in the browser bar of a record. The Archives Hub also creates 'bookmark' links to aid citation of collections. This follows a standard format of ‘https://archiveshub.jisc.ac.uk/data/CountryCodeRepositoryCode-Reference’, such as ‘https://archiveshub.jisc.ac.uk/data/gb12-ms.add.9267’. These contain semantic information and are human readable to an extent. The country code is always 'GB’ or IM for the UK or Isle of Man. The repository code will correspond to the [ARCHON code|https://discovery.nationalarchives.gov.uk/find-an-archive] assigned by the National Archives for that particular repository. The reference will be the same as that used by the archive. These are regarded as user friendly for archivists and researchers as the semantic information within them can be understood by those familiar with the collections, however this relies on the reference being persistent, and that is not always the case. Changes are not frequent but do occur, mostly due to items being moved within the hierarchical structure of archive collections, therefore changing their reference number.</p><p>For example, if the photograph listed above was moved from box 3 to box 2 the reference would change from GB 427 USP/3/110a to GB 427 USP/2/XXX, where XXX is the number of the item in the box. This is unlikely to happen in collections which have already been catalogued to item level but it could occur, for example, where boxes or files were rearranged to suit a particular theme.</p><p>Repository codes can also sometimes change for collections where collections are merged. For example, Manchester University Archive (GB 133) holds both the University Archive and the Methodist Archive (GB 135) which had two different repository codes but these were combined under the Manchester University (GB 133) code which meant that those links needed to be changed.</p><p>Thus far the Archives Hub has changed the bookmark links to match with the most recent version meaning older links would break. Redirects could be put in place to make sure the link continues to remain resolvable but where items have been reclassified within the hierarchy, a reference could be reused for a different record. These links do not have any governance that they will be persistent but best efforts are made to do so where possible. The longevity of the Hub means that they have encountered issues which occur over time and which may not have yet been encountered by more recent implementations. As the Archives Hub is an aggregator of metadata, they cannot create persistent links themselves as they do not have the capability of ensuring the accuracy and quality of the metadata they hold.</p><h4>Low barrier to entry</h4><p>The Archives Hub’s broad experience aggregating data from diverse collections provides some useful insights into any type of persistent identifier implementation or recommendations which could feed into the Towards a National Collection programme. They have prioritised keeping the user base as broad as possible and making sure anything they develop works for all of the contributing archives. This can mean that progress is slow and solutions may not have as many features as what larger, better-resourced organisations could accommodate, however, it does mean that a huge array of collections are more discoverable and accessible.</p><p>For the Heritage PIDs project, it is a salient reminder to think about the requirements we are developing for the sector and making our project’s recommendations and guidance as inclusive as possible. This does not mean that institutions should not try to make their collections as persistently, globally identifiable and resolvable as possible, but it does mean that any tools developed in support of a national collection should be lightweight and implemented by collections easily within minimal financial and human resources.</p>",    
    "content right": ""
    },
  "Developing IDs Blog": {
    "title": "<b>Developing \"Developing Identifiers for Heritage Collections\"</b>",
    "parent": "Blog",
    "content": "<p><i>Frances Madden <a href=\"http:\/\/orcid.org\/0000-0002-5432-6116\">(orcid.org\/0000-0002-5432-6116)<\/a><\/i><\/p><p>Posted 21 April 2021.<\/p><p>On 21 April the Heritage PIDs project held a workshop where we launched a new resource - [Developing Identifiers for Heritage Collections|https:\/\/tanc-ahrc.github.io\/PIDResources\/]. This resource was developed following the findings of the survey the project ran throughout summer 2020. The findings of the survey were that respondents generally knew about PIDs but they weren't sure what to do next. In response to this the project decided to develop a matrix of requirements for PIDs at different levels of complexity so heritage professionals could see examples of 'end goals'. The original idea was to develop something similar to 5* Linked Open Data but the idea grew a lot along the way!<\/p><h4>What did we do?<\/h4><p>We started with the idea of 'levels' of PID implementation, starting with something very simple moving through increasing levels of complexity. To work out what these different levels are, we held a project workshop in January 2021 where we gathered as many use cases as possible using a Kanban exercise on a Miro board. In total over 100 use cases of where and when PIDs can be used in a cultural heritage setting and how they can help professionals in their work. A Kanban exercise allows participants to refine and iterate ideas. Participants in the workshop brought at least five use cases to the workshop. During the Kanban exercise we went around in a virtual circle iterating on each other's ideas. As you can see from the image, it got quite messy!<\/p>\r\n    <figure class=\"figure\"><img src=\"graphics\/workshop03.png\" class=\"figure-img img-fluid rounded\" alt=\"Screenshot of categorised use cases for PIDs\"><figcaption class=\"figure-caption\">Screenshot of categorised use cases for PIDs<\/figcaption><\/figure><p>Following the workshop, these were sorted into different categories and based on the frequency with which they occurred importance was assigned to these various levels.<\/p><p>The categories were:<\/p>\r\n    <ul><li>Interoperability<\/li><li>Where, what and how of collections<\/li>\r\n\t   <li>Long-term-ness<\/li><li>Versioning<\/li><\/ul>\r\n     <figure class=\"figure\"><img src=\"graphics\/workshop04.png\" class=\"figure-img img-fluid rounded\" alt=\"Screenshot of categorised use cases for PIDs\"><figcaption class=\"figure-caption\">Screenshot of categorised use cases for PIDs<\/figcaption><\/figure>\r\n     <p>By far the vast majority of use cases related to the 'Interoperability' theme. Interoperability represents a collection of different categories which were eventually grouped together.<\/p>\r\n\t    <ul><li>Cross-linking<\/li><li>Cross-searching<\/li>\r\n      <li>Aggregation<\/li> <li>Machine Readability<\/li><\/ul>\r\n      <p>The Where, what and how of collections also had several sub-categories:<\/p>\r\n\t     <ul><li>Citation<\/li>\r\n       <li>Reporting<\/li>\r\n       <li>Collection information<\/li><\/ul>\r\n       <figure class=\"figure\"><img src=\"graphics\/workshop02.png\" class=\"figure-img img-fluid rounded\" alt=\"Screenshot of categorised use cases for PIDs\"><figcaption class=\"figure-caption\">Screenshot of categorised use cases for PIDs<\/figcaption><\/figure>\r\n       <p>Based on these categories, the following levels were determined as a first iteration of the level of PIDs.<\/p>\r\n       <table class=\"table\">\r\n       <thead>\r\n       <tr>\r\n       <th scope=\"col\">Level<\/th>\r\n       <th scope=\"col\">Description<\/th>\r\n       <\/tr>\r\n       <\/thead>\r\n       <tbody>\r\n       <tr><th scope=\"row\">1<\/th>\r\n       <td>Externally-created persistent identifiers are included for items and entities within metadata.<\/td>\r\n       <\/tr>\r\n       <tr><th scope=\"row\">2<\/th>\r\n       <td>\r\n       Items and entities are assigned identifiers which could be machine readable and persistent.\r\n       <\/td>\r\n       <\/tr>\r\n       <tr><th scope=\"row\">3<\/th>\r\n       <td>\r\n       Items and entities are assigned identifiers which are externally resolvable in a human readable format. \r\n       <\/td>\r\n       <\/tr>\r\n       <tr><th scope=\"row\">4<\/th>\r\n       <td>\r\n       Items and entities are assigned identifiers which are resolvable in a machine readable format.  \r\n       <\/td>\r\n       <\/tr>\r\n       <tr><th scope=\"row\">5<\/th>\r\n       <td>\r\n       Items and entities are assigned globally persistent, universally resolvable and maintained identifiers. \r\n       <\/td>\r\n       <\/tr>\r\n      <\/tbody>\r\n      <\/table>\r\n       <p>When the project discussed these levels as a whole, several issues came up. It became clear we needed to establish a baseline implementation so, a Level 0. It also became clear that these levels were never going to be an entirely linear progression and we also needed to acknowledge that an institutional commitment to persistence was needed.<\/p>\r\n       <p>While we had hoped that we could hold all the information needed for this resource within a table, it became clear that there was too much information for anything readable to be created. We felt it was important we gave an explanation for what we meant and that we communicated the benefits of each level. We also wanted to be able to map these against different PID types which met this criteria.<\/p>\r\n       <p>The next version was more akin to what we have now. Rather than focusing on different levels we decided to focus on the different aspects of implementing persistent identifiers and how it can be done, we tried to have a standard layout which focuses on the potential benefits, the risks and dependencies as well as linking to examples of similar implementations from other cultural heritage organisations. In addition to the pages outlining the different aspects we have also included mappings of use cases to the different aspects as well as listing different PID types and how they meet the different aspects.<\/p>\r\n       <p>In parallel we were discussing how we may gain feedback for this resource and how to publish it. We decided that Github would provide a useful way to track comments and changes to the resource. Anyone using the resource could raise a Github issue describing any changes or comments they had for the resource. As you need a Github account to raise an issue, we also decided to use another feedback tool, [Usersna|https:\/\/usersnap.com\/], where you can select a section of the screen and leave comments or suggestions.<\/p>\r\n       <h4>What's next?<\/h4>\r\n       <p>This resource is open for consultation until the end of May 2021 at which point we will update it. We will continue to update this resource throughout 2021 until the end of the Heritage PIDs project. It will be updated on a best efforts basis after that until the end of the Towards a National Collection to reflect the changes in the environment which we hope take place.<\/p>\r\n       <p>The next stage for us is to compile guidance about how to develop each of these aspects. We would love to hear from you with your implementations and examples. If you have something to share, please fill in this [Google Form|https:\/\/forms.gle\/CS3pYboPXWo7oCUo6].<\/p>\r\n       <h4>What you can do? <\/h4>\r\n       <p>Please have a look at the resource and leave any comments. If you use it to inform your decision making, let us know!<\/p>",
    "content right": ""
  }
}
