{
"home": {
  "title": "Towards a National Collection - HeritagePIDs",
  "content": "<div class=\"alert alert-info\" role=\"alert\"><p>How can we build a national collection if we do not know what is in it?<\/p><\/div><p>Museums, heritage collections and sites in the UK house at least 200 million physical and digital objects. Being able to identify these objects supports their discovery, use and curation - you cannot provide persistent or even consistent access to an item if you don't know what it is. Accession numbers are a key component in all collection and library management systems but these only cover selected objects within an individual collection. To fully realise the potential of our national collections, we need identifiers that can bring together collections across institutional boundaries.<\/p><p>Persistent Identifiers (PIDs) provide a long-lasting click-able link to a digital object. They are recognised by UKRI as a tool for enabling data discovery, access and citation. Supporting wider use of PIDs for collection objects, environments, specimens and related items will allow long-term, unambiguous linking of collections that will create a digital National Collection. However, the challenges, utility and wider benefits of PIDs are not as well understood across the heritage sector as they could be.<\/p><p>This project will bring together best practices in the use of PIDs, building on existing work and projects. We will share expertise and provide recommendations on the approach to PIDs for colleagues in institutions across the UK heritage sector. Through a mixture of workshops, desk research and case studies, the project will answer questions such as 'What are the gaps in the existing PID landscape for heritage collections, buildings and environments?' and 'What should a PID infrastructure, strategy and governance framework look like for a unified national collection?'.<\/p><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": "<figure class=\"figure\"><img src=\"graphics/Japanese Camellia.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37.\"><figcaption class=\"figure-caption\">Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37. Public Domain.<\/figcaption><\/figure>"
  },
"about": {
  "class": "gallery",
  "file": "logos.json",
  "title": "HeritagePIDs - Contributors",
  "content": "<p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": ""
  },
"resources": {
  "title": "Resources - HeritagePIDs",
  "content": "<p>This page will be updated throughout the project as new material becomes available.</p><p><b>Project Outputs</b></p><ul><li>PIDs as IRO Infrastructure - Early Findings <a href=\"https://doi.org/10.23636/1214\">https://doi.org/10.23636/1214</a></li><li>Towards a National Collection: Persistent Identifiers as IRO Infrastructure Project Launch Webinar <a href=\"https:\/\/doi.org\/10.23636\/1174\">https:\/\/doi.org\/10.23636\/1174<\/a><\/li><li>Webinar: Identifiers in Heritage Collections - how embedded are they? <a href=\"https://doi.org/10.23636/1189\">https://doi.org/10.23636/1189<\/a><\/li><li>HeritagePIDs Zotero Group <a href=\"https:\/\/www.zotero.org\/groups\/2470432\/heritagepids\/\">https:\/\/www.zotero.org\/groups\/2470432\/heritagepids<\/a><\/li></ul><p><b>Blog Posts</b></p><ul><li>When is a persistent identifier not persistent? Or an identifier? <a href=\"https://blogs.bl.uk/digital-scholarship/2020/09/when-is-a-persistent-identifier-not-persistent-or-an-identifier.html\">https://blogs.bl.uk/digital-scholarship/2020/09/when-is-a-persistent-identifier-not-persistent-or-an-identifier.html</a></li><\/ul><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>", 
  "content right": ""  
},
 "timeline": {
   "title": "Project Timeline - HeritagePIDs",
   "content": "<p>This timeline is provisional due to the COVID-19 pandemic and may be changed throughout the project.</p><table><tbody><tr><td><p><strong>Date</strong></p></td><td><p><strong>Milestone Type</strong></p></td><td><p><strong>Detail</strong></p></td></tr><tr><td><p><span>Jan 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>PIDapalooza Lightning Talk</span></p></td></tr><tr><td><p><span>April 2020</span></p></td><td><p><span>Dissemination</span></p><p><span>Deliverable</span></p></td><td><p><span >RDA PID IG Lightning Talk</span></p><p><span>Webinar #1</span></p></td></tr><tr><td><p><span >May 2020</span></p></td><td><p>Deliverable</p></td><td><p><span>Survey #1 Launched</span></p></td></tr><tr><td><p><span>July 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>Webinar #2 Interim survey results</span></p></td></tr><tr><td><p><span>August 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span >Case study #1 British Library</span></p></td>   </tr><tr><td><p><span>Sept 2020</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #2 National Gallery</span></p></td></tr><tr><td><p><span>Oct 2020</span></p></td><td><p><span>Dissemination</span></p><p><span>Deliverable</span></p></td><td><p><span>Webinar #3 Final survey and case studies #1+2</span></p><p><span>Interim report</span></p></td></tr><tr><td><p><span>Jan 2021</span></p></td><td><p><span>Deliverable</span></p><p><span>Deliverable</span></p></td><td><p><span>Demonstrator Tool in Beta</span></p><p><span>Workshop (online)</span></p></td></tr><tr><td><p><span>March 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #3 Natural History Museum</span></p></td></tr><tr><td><p><span>April 2021</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>Webinar based on case study #3</span></p></td></tr><tr><td><p><span>May 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #4 Royal Botanic Gardens Edinburgh</span></p></td></tr><tr><td><p><span>June 2021</span></p></td><td><p><span>Deliverable</span></p><p><span>Deliverable</span></p></td><td><p><span>Workshop #4 Edinburgh</span></p><p><span>Survey #2 Launch</span></p></td></tr><tr><td><p><span>August 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Video summarising best practices</span></p></td></tr></tbody></table>",
   "content right": ""
},
 "Blog": {
    "title": "HeritagePIDs Blog",
    "content": "<p>The HeritagePIDs blog contains case studies describing use cases for persistent identifiers (PIDs) and requirements different institutions have for them.<\/p>",
     "content right": ""
 },
  "LCD Blog": {
    "title": "Linked Conservation Data and PIDs", 
    "parent": "Blog",
    "content": "<h2>Linked Conservation Data and PIDs</h2><p><i>Frances Madden <a href=\"http://orcid.org/0000-0002-5432-6116\">(orcid.org/0000-0002-5432-6116)</a></i></p><p> Posted 12 November 2020</p><br><p><a href=\"https://www.ligatus.org.uk/lcd/\">Linked Conservation Data</a> (LCD) is a project led by the University of the Arts London and the Stanford University Library amongst others. It aims to explore heritage conservation data, conservation documentation records, such as treatment reports, expressed as structured data and apply Linked Open Data techniques to it. The project is funded by the UK's Arts and Humanities Research Council and is now in its second phase.</p><p>Conservation systems and practices do not have a tradition of assigning identifiers to records or the objects with which they are concerned, and therefore the systems do not always use identifiers consistently either. In addition, conservation systems can often be separate and siloed from cataloguing and collection management systems, as is the case at the British Library, amongst other institutions, reducing the interoperability across systems. The LCD project wants to explore research questions which integrated conservation information can answer e.g. the use of particular techniques over time and the geographical use of particular techniques as well as the information conservation data can provide about a collection. From an identifier perspective the project’s work involves assigning identifiers both to conservation terms and the items which are being conserved.</p><p>During this phase of the project, they have produced draft <a href=\"https://www.ligatus.org.uk/lcd/output/193\">vocabulary guidelines</a> to assist others in producing Linked Data for conservation records and terms used within them. In phase one of the project the need for identifiers as a key component of Linked Data was recognised. The project aims to explore and connect vocabulary terms held in different partners’ cataloguing systems, to be able to cross-link terms. LCD have decided to utilise <a href=\"https://www.w3.org/2004/02/skos/\">SKOS</a> which is a long existing defined framework for publishing thesauri, vocabularies and taxonomies in a structured and machine readable format, therefore maximising interoperability. More generally, the idea of creating identifiers for vocabularies presents some specific requirements.</p><p>The project is exploring the extent to which terms can be matched and issues concerning granularity of terms. They have also adopted the best practice approaches of assigning Uniform Resource Identifiers (URIs) to the terms used and this requirement is included in the draft terminology guidelines. They are also exploring how best to leverage existing infrastructure such as existing thesauri of terms some of which already have URIs in use, e.g. the <a href=\"https://www.getty.edu/research/tools/vocabularies/aat/\">Getty Art and Architecture Thesaurus</a> (AAT).</p><p>For vocabulary maintainers LCD suggests registering URIs using the <a href=\"https://w3id.org/\">w3id.org</a> system. The <a href=\"https://www.ligatus.org.uk/lcd/output/142\">workflow diagrams</a> produced by the project suggest either linking terms in an organisation’s system to an existing vocabulary which already uses URIs or assigning locally produced URIs to the terms created.</p><p>The National Gallery, a partner in both LCD and the PIDs as IRO Infrastructure projects, which has developed their own infrastructure as part of a pilot project to mint URIs, described in the project case study which is soon to be published, has offered to host URIs for the next phase of the project using a simple vocab server or <a href=\"https://www.researchspace.org/\">ResearchSpace</a> instance. The issue of URIs being dereferenceable is apparent from the guidelines created by the project, for vocabulary terms. While it is best practice that URIs resolve to information about the term referenced, at the moment this is not an absolute requirement. Making it a requirement would mean that entering the Linked Data realm would require significant new infrastructure to host and serve data and the partners in Linked Conservation Data do not want to make it too difficult for organisations with limited resources to take this first step. In the meantime employing identifiers in current systems helps with adoption of good practices which can lead to making their conservation data available as Linked Open Data.</p><p>The benefit from these URIs from being universally and globally resolvable, i.e. being able to resolve to the record without knowing which institution created the record, is not clear at this stage in the project, nor is it being actively explored at this stage for the reasons described above. As an example of a globally resolvable identifier, ‘https://data.ng-london.org.uk/0F6J-0001-0000-0000’ could be expressed instead as a DOI such as ‘https://doi.org/10.12345/0F6J-0001-0000-0000’, removing the requirement for any knowledge by the user of the ‘data.ng-london.org.uk’ namespace. This capability may benefit some of the widely used vocabularies such as the AAT and encourage the adoption of a single or one system, becoming a de facto terminology hub, but issues of granularity and mapping terms from internal systems would still need to be addressed. As most of the organisations involved in the project are memory institutions themselves, they may already have the infrastructure in place to provide long lasting identifiers, however the lack of centralised governance associated with locally managed identifiers presents a risk to the long term accessibility of the URIs in this aspect and the interest and willingness of these organisations to commit to hosting these identifiers is also untested.</p><p>The different entity types assigned URIs may also present different issues when it comes to their long term maintenance. While vocabulary terms may be used by multiple organisations and would clearly warrant long term community driven sustainability efforts to maintain the URIs for the terms and keep them updated, the same may not be the case for the URIs for collection items undergoing conservation as they may only be linked and used by its holding organisation.</p><p>For the partners involved in the project, some, but not all, are already able to create internal identifiers within their own systems. While the internal system identifiers may provide some degree of solution across internal systems e.g. between cataloguing and conservation, they are not necessarily persistent and they may not be ideal for Linked Data even if they are formed as URIs. It seems sensible for any organisation who is implementing a new system or upgrading an existing system to consider exposing this data in an open format as part of the implementation. The LCD project is investigating hosting the infrastructure on a jointly held repository or portal within the project partners which will be machine readable and query-able via a SPARQL endpoint and API with web-browsing capability for human readable access. This portal, an instance of ResearchSpace, will provide a useful prototype demonstrating the potential of the approaches but a model for its long term sustainability is yet to be decided.</p><p>While sustainability is a challenge for any type of identifier, identifiers for heritage objects address several different use cases, including reference and citation as well as conservation, and it is anticipated conservation data would only be one of those, strengthening the case for identifiers being assigned to collection items. The survey conducted by the PIDs as IRO Infrastructure Project (described <a href=\"https://doi.org/10.23636/1214\">here</a>) found that many of the organisations who were using PIDs were using URIs as a result of applying Linked Open Data approaches to their collection items (<a href=\"https://doi.org/10.23636/1210\">summary data</a>). The use case for conservation data presents another dimension to these efforts and could result in identifiers being embedded in aspects of collections which they otherwise would not.</p>",
    "content right": ""
 }
}
