{
"home": {
  "title": "Towards a National Collection - HeritagePIDs",
  "content": "<div class=\"alert alert-info\" role=\"alert\"><p>How can we build a national collection if we do not know what is in it?<\/p><\/div><p>Museums, heritage collections and sites in the UK house at least 200 million physical and digital objects. Being able to identify these objects supports their discovery, use and curation - you cannot provide persistent or even consistent access to an item if you don't know what it is. Accession numbers are a key component in all collection and library management systems but these only cover selected objects within an individual collection. To fully realise the potential of our national collections, we need identifiers that can bring together collections across institutional boundaries.<\/p><p>Persistent Identifiers (PIDs) provide a long-lasting click-able link to a digital object. They are recognised by UKRI as a tool for enabling data discovery, access and citation. Supporting wider use of PIDs for collection objects, environments, specimens and related items will allow long-term, unambiguous linking of collections that will create a digital National Collection. However, the challenges, utility and wider benefits of PIDs are not as well understood across the heritage sector as they could be.<\/p><p>This project will bring together best practices in the use of PIDs, building on existing work and projects. We will share expertise and provide recommendations on the approach to PIDs for colleagues in institutions across the UK heritage sector. Through a mixture of workshops, desk research and case studies, the project will answer questions such as 'What are the gaps in the existing PID landscape for heritage collections, buildings and environments?' and 'What should a PID infrastructure, strategy and governance framework look like for a unified national collection?'.<\/p><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": "<figure class=\"figure\"><img src=\"graphics/Japanese Camellia.jpg\" class=\"figure-img img-fluid rounded\" alt=\"Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37.\"><figcaption class=\"figure-caption\">Pale pink Japanese camellia (Camellia japonica) by an unknown Chinese artist, c.1800. British Library, NHD 52\/37. Public Domain.<\/figcaption><\/figure>"
  },
"about": {
  "class": "gallery",
  "file": "logos.json",
  "title": "HeritagePIDs - Contributors",
  "content": "<p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": ""
  },
"resources": {
  "title": "Resources - HeritagePIDs",
  "content": "<p>This page will be updated throughout the project as new material becomes available.</p><ul><li>Towards a National Collection: Persistent Identifiers as IRO Infrastructure Project Launch Webinar <a href=\"https:\/\/doi.org\/10.23636\/1174\">https:\/\/doi.org\/10.23636\/1174<\/a><\/li><li>Identifiers in Heritage Collections - how embedded are they? <a href=\"https://doi.org/10.23636/1189\">https://doi.org/10.23636/1189<\/a><\/li><li>HeritagePIDs Zotero Group <a href=\"https:\/\/www.zotero.org\/groups\/2470432\/heritagepids\/\">https:\/\/www.zotero.org\/groups\/2470432\/heritagepids<\/a><\/li><\/ul><p>This project is a Foundation project within the <a href=\"https:\/\/ahrc.ukri.org\/\">AHRC<\/a> funded <a href=\"https:\/\/ahrc.ukri.org\/research\/fundedthemesandprogrammes\/tanc-opening-uk-heritage-to-the-world\/\">Towards a National Collection Programme<\/a>.<\/p>",
  "content right": ""
  },
 "timeline": {
   "title": "Project Timeline - HeritagePIDs",
   "content": "<p>This timeline is provisional due to the COVID-19 pandemic and may be changed throughout the project.</p><table><tbody><tr><td><p><strong>Date</strong></p></td><td><p><strong>Milestone Type</strong></p></td><td><p><strong>Detail</strong></p></td></tr><tr><td><p><span>Jan 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>PIDapalooza Lightning Talk</span></p></td></tr><tr><td><p><span>April 2020</span></p></td><td><p><span>Dissemination</span></p><p><span>Deliverable</span></p></td><td><p><span >RDA PID IG Lightning Talk</span></p><p><span>Webinar #1</span></p></td></tr><tr><td><p><span >May 2020</span></p></td><td><p>Deliverable</p></td><td><p><span>Survey #1 Launched</span></p></td></tr><tr><td><p><span>July 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>Webinar #2 Interim survey results</span></p></td></tr><tr><td><p><span>August 2020</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span >Case study #1 British Library</span></p></td>   </tr><tr><td><p><span>Sept 2020</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #2 National Gallery</span></p></td></tr><tr><td><p><span>Oct 2020</span></p></td><td><p><span>Dissemination</span></p><p><span>Deliverable</span></p></td><td><p><span>Webinar #3 Final survey and case studies #1+2</span></p><p><span>Interim report</span></p></td></tr><tr><td><p><span>Jan 2021</span></p></td><td><p><span>Deliverable</span></p><p><span>Deliverable</span></p></td><td><p><span>Demonstrator Tool in Beta</span></p><p><span>Workshop (online)</span></p></td></tr><tr><td><p><span>March 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #3 Natural History Museum</span></p></td></tr><tr><td><p><span>April 2021</span></p></td><td><p><span>Dissemination</span></p></td><td><p><span>Webinar based on case study #3</span></p></td></tr><tr><td><p><span>May 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Case study #4 Royal Botanic Gardens Edinburgh</span></p></td></tr><tr><td><p><span>June 2021</span></p></td><td><p><span>Deliverable</span></p><p><span>Deliverable</span></p></td><td><p><span>Workshop #4 Edinburgh</span></p><p><span>Survey #2 Launch</span></p></td></tr><tr><td><p><span>August 2021</span></p></td><td><p><span>Deliverable</span></p></td><td><p><span>Video summarising best practices</span></p></td></tr></tbody></table>",
   "content right": ""
 },
"blog": {
  "title": "Blog",
  "content": "<h3>When is a persistent identifier not persistent? Or an identifier?</h3><p>Ever wondered what that bar code on the back of every book is? It’s an ISBN: an International Standard Book Number. Every modern book published has an ISBN, which uniquely identifies that book, and anyone publishing a book can <a href="https://www.bl.uk/help/get-an-isbn-or-issn-for-your-publication">get an ISBN for it</a> whether an individual or a huge publishing house. It’s a little more complex than that in practice but generally speaking it’s 1 book, 1 ISBN. Right? Right.</p><p>Except…</p><p>If you search an online catalogue, such as <a href="https://www.worldcat.org/search?qt=worldcat_org_all">WorldCat</a> or <a href="http://explore.bl.uk/primo_library/libweb/action/search.do?fn=search&ct=search&initialSearch=true&mode=Basic&tab=local_tab&indx=1&dum=true&srt=rank&vid=BLVU1&frbg=&tb=t&vl%28freeText0%29=9780393073775&scp.scps=scope%3A%28BLCONTENT%29&vl%282084770704UI0%29=any&vl%282084770704UI0%29=title&vl%282084770704UI0%29=any&_ga=2.163876219.598920147.1599472396-1248571151.1564395492">The British Library</a> for the ISBN 9780393073775 (or the 10-digit equivalent, 0393073777) you’ll find results appear for two completely different books:</p><ol><li>Waal FD. The Bonobo and the Atheist: In Search of Humanism Among the Primates. New York: W. W. Norton & Co.; 2013. 304 p. <a href="http://www.worldcat.org/oclc/1167414372">http://www.worldcat.org/oclc/1167414372</a></li><li>Lodge HC. The Storm Has Many Eyes; a Personal Narrative. 1st edition. New York: New York Norton; 1973. <a href"http://www.worldcat.org/oclc/989188234">http://www.worldcat.org/oclc/989188234</a></li></ol><p>In fact, things are so confused that the cover of one book gets pulled in for the other as well. Investigate further and you’ll see that it’s not a glitch: both books have been assigned the same ISBN. Others have found the same:</p><p>“However, if the books do not match, it’s usually one of two issues. First, if it is the same book but with a different cover, then it is likely the ISBN was reused for a later/earlier reprinting. … In the other case of duplicate ISBNs, it may be that an ISBN was reused on a completely different book. This shouldn’t happen because ISBNs are supposed to be unique, but exceptions have been found.” — <a href="https://help.goodreads.com/s/article/Librarian-Manual-ISBN-10-ISBN-13-and-ASINS">GoodReads Librarian Manual: ISBN-10, ISBN-13 and ASINS</a></p><p>While most publishers stick to the rules about never reusing an ISBN, it’s apparently common knowledge in the book trade that ISBNs from old books get reused for newer books, sometimes accidentally (due to a typo), sometimes intentionally (to save money), and that has some tricky consequences.</p><p>I recently attended a webinar entitled <a href="https://doi.org/10.23636/1189">“Identifiers in Heritage Collections - how embedded are they?”</a> from the <a href="https://tanc-ahrc.github.io/HeritagePIDs/">Persistent Identifiers as IRO Infrastructure (“HeritagePIDs”) project</a>, part of <a href="https://ahrc.ukri.org/research/fundedthemesandprogrammes/tanc-opening-uk-heritage-to-the-world/">AHRC’s Towards a National Collection programme</a>. As quite often happens, the question was raised: <b>what Persistent Identifier (PID) should we use for books</b> and <b>why can’t we just use ISBNs?</b> Rod Page, who gave the <a href="https://pid-demonstrator.herokuapp.com/demo/">demo that prompted this discussion</a>, also wrote a short follow-up blog post about <a href="https://iphylo.blogspot.com/2020/07/persistent-identifiers-demo-and-rant.html?m=1">what makes PIDs work (or not)</a> which is worth a look before you read the rest of this.</p><p>These are really valid questions and worth considering in more detail, and to do that we need to understand what makes a PID special. We call them <b>persistent</b>, and indeed we expect some sort of guarantee that a PID remains valid for the long term, so that we can use it as a link or placeholder for the referent without worrying that the link will get broken. But we also expect PIDs to be <b>actionable</b>: it can be made into a valid URL by following some rules: so that we can directly obtain the object referenced or at least some information about it.</p><p>Actionability implies two further properties: an actionable identifier must be</p><ol><li>Unique: guaranteed to have only one identifier for a given object (of a given type); and</li><li>Unambiguous: guaranteed that a single identifier refers to only one object</li><p>Where does this leave us with ISBNs?</p><p>Well first up they’re not actionable to start with: given an ISBN, there’s no canonical way to obtain information about the book referenced, although in practice there are a number of databases that can help. There is, in fact, an actionable ISBN standard: <a href="https://www.doi.org/factsheets/ISBN-A.html">ISBN-A</a> permits converting an ISBN into a DOI with all the benefits of the underlying DOI and Handle infrastructure. Sadly, creation of an ISBN-A isn’t automatic and publishers have to explicitly create the ISBN-A DOI in addition to the already-create ISBN; most don’t.</p><p>More than that though, it’s hard to make them actionable since ISBNs fail on both uniqueness and unambiguity. Firstly, as seen in the example I gave above, ISBNs do get recycled, They’re not supposed to be:</p><p>“Once assigned to a monographic publication, an ISBN can never be reused to identify another monographic publication, even if the original ISBN is found to have been assigned in error.” — International ISBN Agency. ISBN Users’ Manual [Internet]. Seventh Edition. London, UK: International ISBN Agency; 2017 [cited 2020 Jul 23]. Available from: <a href="https://www.isbn-international.org/content/isbn-users-manual">https://www.isbn-international.org/content/isbn-users-manual</a></p><p>Yet they are, so we can’t rely on their precision.[1]</p><p>Secondly, and perhaps more problematic in day-to-day use, a given book may have multiple ISBNs. To an extent this is reasonable: different editions of the same book may have different content, or at the very least different page numbering, so a PID should be able to distinguish these for accurate citation. Unfortunately the same edition of the same book will frequently have multiple ISBNs; in particular each different format (hardback, paperback, large print, ePub, MOBI, PDF, …) is expected to have a distinct ISBN. Even if all that changes is the publisher, a new ISBN is still created:</p><p>“We recently encountered a case where a publisher had licensed a book to another publisher for a different geographical market. Both books used the same ISBN. If the publisher of the book changes (even if nothing else about the book has changed), the ISBN must also change.” — <a href="https://www.linkedin.com/pulse/everything-you-wanted-know-isbn-were-too-afraid-ask-leonard-fernandes/">Everything you wanted to know about the ISBN but were too afraid to ask</a></p><p>Again, this is reasonable since the ISBN is primarily intended for stockkeeping by book sellers[2], and for them the difference between a hardback and paperback is important because they differ in price if nothing else. This has bitten more than one librarian when trying to merge data from two different sources (such as usage and pricing) using the ISBN as the “obvious” merge key. It makes <a href"https://en.wikipedia.org/wiki/Bibliometrics">bibliometrics</a> harder too, since you can’t easily pull out a list of all citations of a given edition in the literature, just from a single ISBN.</p><p>So where does this leave us?</p><p>I’m not really sure yet. ISBNs as they are currently specified and used by the book industry aren’t really fit for purpose as a PID. But they’re there and they sort-of work and establishing a more robust PID for books would need commitment and co-operation from authors, publishers and libraries. That’s not impossible: a lot of work has been done recently to <a href="https://www.pidforum.org/t/guides-to-choosing-persistent-identifiers-your-feedback-wanted/1013/6">make the ISSN (International Standard Serial Number, for journals) more actionable</a>.</p><p>But perhaps there are other options. Where publishers, booksellers and libraries are primarily interested in IDs for stock management, authors, researchers and scholarly communications librarians are more interested in the scholarly record as a whole and tracking the flow of ideas (and credit for those) which is where PIDs come into their own. Is there an argument for a coalition of these groups to establish a parallel identifier system for citation & credit that’s truly persistent? It wouldn’t be the first time: <a href="https://isni.org/">ISNIs (International Standard Name Identifiers)</a> and <a href="https://orcid.org/">ORCIDs (Open Researcher and Contributor IDs)</a> both identify people, but for different purposes in different roles and with robust metadata linking the two where possible.</p><p>I’m not sure where I’m going with this train of thought so I’ll leave it there for now, but I’m sure I’ll be back. The more I dig into this the more there is to find, including the mysterious, long-forgotten and no-longer accessible <a href="https://web.archive.org/web/19981205052218/http://www.bic.org.uk:80/bic/bici.html"Book Item & Component Identifier proposal</a>. In the meantime, if you want a persistent identifier and aren’t sure which one you need these <a href="https://doi.org/10.5281/zenodo.3862655">Guides to Choosing a Persistent Identifier</a> from Project FREYA should get you started.</p><p>[1] Actually, as my colleague pointed out, even DOIs potentially have this problem, although I feel they can mitigate it better with metadata that allows rich expression of relationships between DOIs.</p><p>[2] In fact, the newer ISBN-13 standard is simply an ISBN-10 encoded as an “International Article Number”, the standard barcode format for almost all retail products, by sticking the “Bookland” country code of 978 on the front and recalculating the check digit.</p>
"content right": ""
}
}
